tutorials/16geomParNS_review/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            walls;
        nFaces          121;
        startFace       87958;
    }
    bottom
    {
        type            walls;
        nFaces          121;
        startFace       88079;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          88400;
        startFace       88200;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       176600;
    }
    outlet
    {
        type            patch;
        nFaces          542;
        startFace       176700;
    }
)

// ************************************************************************* //
